app/controllers/posts_controller.rb

  def index


    @posts = Post.paginate :page => params[:page], :per_page  => 10, :order  => "created_at DESC"
---
SELECT * FROM "posts" ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "posts"

  def tag
    @posts = Post.find_tagged_with(params[:id])
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags".id = "taggings".tag_id WHERE (("taggings".taggable_type = 'Post') AND ("taggings".taggable_id = 2))

  def show
    @post = Post.find(params[:id])
    @newcomment = Comment.new
    @comment = Comment.find(:all, :conditions => {:post_id => params[:id]})
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "comments" WHERE ("comments"."post_id" = '--- :id

  def edit
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("visible", "updated_at", "title", "body", "parentid", "owner", "shownuser", "created_at") VALUES('t', '2009-08-13 20:04:21', 'hello world', 'die welt ist die summe der tatsachen, nicht der dinge', NULL, 0, 'beerli', '2009-08-13 20:04:21')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "updated_at" = '2009-08-13 20:42:21', "owner" = 17 WHERE "id" = 1

  def destroy
    @post = Post.find(params[:id])
    @user = current_user
  if @post.owner == @user.id
    @post.destroy
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
DELETE FROM "posts" WHERE "id" = 1