app/controllers/topquotes_controller.rb

  def index
    @topquotes = Topquote.all
---
SELECT * FROM "topquotes"

  def show
    @topquote = Topquote.find(params[:id])
---
SELECT * FROM "topquotes" WHERE ("topquotes"."id" = 1)

  def create
    @topquote = Topquote.new(params[:topquote])

    respond_to do |format|
      if @topquote.save
---
INSERT INTO "topquotes" ("updated_at", "title", "created_at") VALUES('2009-08-18 00:17:29', 'ALLES NEU MACHT DER MAI', '2009-08-18 00:17:29')